#ifndef GAME_STATE_READER_H
#define GAME_STATE_READER_H

/* Generated by flatcc 0.6.2 FlatBuffers schema compiler for C by dvide.com */

#ifndef FLATBUFFERS_COMMON_READER_H
#include "flatbuffers_common_reader.h"
#endif
#include "flatcc/flatcc_flatbuffers.h"
#ifndef __alignas_is_defined
#include <stdalign.h>
#endif
#include "flatcc/flatcc_prologue.h"
#ifndef flatbuffers_identifier
#define flatbuffers_identifier 0
#endif
#ifndef flatbuffers_extension
#define flatbuffers_extension "bin"
#endif

typedef struct Vec2 Vec2_t;
typedef const Vec2_t *Vec2_struct_t;
typedef Vec2_t *Vec2_mutable_struct_t;
typedef const Vec2_t *Vec2_vec_t;
typedef Vec2_t *Vec2_mutable_vec_t;
typedef struct BlockHitUpdate BlockHitUpdate_t;
typedef const BlockHitUpdate_t *BlockHitUpdate_struct_t;
typedef BlockHitUpdate_t *BlockHitUpdate_mutable_struct_t;
typedef const BlockHitUpdate_t *BlockHitUpdate_vec_t;
typedef BlockHitUpdate_t *BlockHitUpdate_mutable_vec_t;
typedef struct ThrusterUpdate ThrusterUpdate_t;
typedef const ThrusterUpdate_t *ThrusterUpdate_struct_t;
typedef ThrusterUpdate_t *ThrusterUpdate_mutable_struct_t;
typedef const ThrusterUpdate_t *ThrusterUpdate_vec_t;
typedef ThrusterUpdate_t *ThrusterUpdate_mutable_vec_t;
typedef struct ShieldUpdate ShieldUpdate_t;
typedef const ShieldUpdate_t *ShieldUpdate_struct_t;
typedef ShieldUpdate_t *ShieldUpdate_mutable_struct_t;
typedef const ShieldUpdate_t *ShieldUpdate_vec_t;
typedef ShieldUpdate_t *ShieldUpdate_mutable_vec_t;

#define EntityUpdate_file_identifier 0
#endif
/* deprecated, use EntityUpdate_file_identifier */
#ifndef EntityUpdate_identifier
#define EntityUpdate_identifier 0
#endif
#define EntityUpdate_type_hash ((flatbuffers_thash_t)0xf2e4eab3)
#define EntityUpdate_type_identifier "\xb3\xea\xe4\xf2"
#ifndef EntityUpdate_file_extension
#define EntityUpdate_file_extension "bin"
#endif
#ifndef SingleBlockEntityUpdate_file_identifier
#define SingleBlockEntityUpdate_file_identifier 0
#endif
/* deprecated, use SingleBlockEntityUpdate_file_identifier */
#ifndef SingleBlockEntityUpdate_identifier
#define SingleBlockEntityUpdate_identifier 0
#endif
#define SingleBlockEntityUpdate_type_hash ((flatbuffers_thash_t)0x87620b0c)
#define SingleBlockEntityUpdate_type_identifier "\x0c\x0b\x62\x87"
#ifndef SingleBlockEntityUpdate_file_extension
#define SingleBlockEntityUpdate_file_extension "bin"
#endif
#ifndef RegularConvexPolygon_file_identifier
#define RegularConvexPolygon_file_identifier 0
#endif
/* deprecated, use RegularConvexPolygon_file_identifier */
#ifndef RegularConvexPolygon_identifier
#define RegularConvexPolygon_identifier 0
#endif
#define RegularConvexPolygon_type_hash ((flatbuffers_thash_t)0x989dd7da)
#define RegularConvexPolygon_type_identifier "\xda\xd7\x9d\x98"
#ifndef RegularConvexPolygon_file_extension
#define RegularConvexPolygon_file_extension "bin"
#endif
#ifndef GameStartingParams_file_identifier
#define GameStartingParams_file_identifier 0
#endif
/* deprecated, use GameStartingParams_file_identifier */
#ifndef GameStartingParams_identifier
#define GameStartingParams_identifier 0
#endif
#define GameStartingParams_type_hash ((flatbuffers_thash_t)0x78448619)
#define GameStartingParams_type_identifier "\x19\x86\x44\x78"
#ifndef GameStartingParams_file_extension
#define GameStartingParams_file_extension "bin"
#endif
#ifndef GameStateDelta_file_identifier
#define GameStateDelta_file_identifier 0
#endif
/* deprecated, use GameStateDelta_file_identifier */
#ifndef GameStateDelta_identifier
#define GameStateDelta_identifier 0
#endif
#define GameStateDelta_type_hash ((flatbuffers_thash_t)0xdcc9188e)
#define GameStateDelta_type_identifier "\x8e\x18\xc9\xdc"
#ifndef GameStateDelta_file_extension
#define GameStateDelta_file_extension "bin"
#endif
#ifndef EndGame_file_identifier
#define EndGame_file_identifier 0
#endif
/* deprecated, use EndGame_file_identifier */
#ifndef EndGame_identifier
#define EndGame_identifier 0
#endif
#define EndGame_type_hash ((flatbuffers_thash_t)0x211964a8)
#define EndGame_type_identifier "\xa8\x64\x19\x21"
#ifndef EndGame_file_extension
#define EndGame_file_extension "bin"
#endif
#ifndef Points_file_identifier
#define Points_file_identifier 0
#endif
/* deprecated, use Points_file_identifier */
#ifndef Points_identifier
#define Points_identifier 0
#endif
#define Points_type_hash ((flatbuffers_thash_t)0xa9f0a4e6)
#define Points_type_identifier "\xe6\xa4\xf0\xa9"
#ifndef Points_file_extension
#define Points_file_extension "bin"
#endif


struct Vec2 {
    alignas(4) float x;
    alignas(4) float y;
};
static_assert(sizeof(Vec2_t) == 8, "struct size mismatch");

static inline const Vec2_t *Vec2__const_ptr_add(const Vec2_t *p, size_t i) { return p + i; }
static inline Vec2_t *Vec2__ptr_add(Vec2_t *p, size_t i) { return p + i; }
static inline Vec2_struct_t Vec2_vec_at(Vec2_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t Vec2__size(void) { return 8; }
static inline size_t Vec2_vec_len(Vec2_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(Vec2)

__flatbuffers_define_struct_scalar_field(Vec2, x, flatbuffers_float, float)
__flatbuffers_define_struct_scalar_field(Vec2, y, flatbuffers_float, float)

struct BlockHitUpdate {
    alignas(4) uint16_t block_index;
    alignas(4) float hitpoints;
    alignas(1) flatbuffers_bool_t is_destroyed;
};
static_assert(sizeof(BlockHitUpdate_t) == 12, "struct size mismatch");

static inline const BlockHitUpdate_t *BlockHitUpdate__const_ptr_add(const BlockHitUpdate_t *p, size_t i) { return p + i; }
static inline BlockHitUpdate_t *BlockHitUpdate__ptr_add(BlockHitUpdate_t *p, size_t i) { return p + i; }
static inline BlockHitUpdate_struct_t BlockHitUpdate_vec_at(BlockHitUpdate_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t BlockHitUpdate__size(void) { return 12; }
static inline size_t BlockHitUpdate_vec_len(BlockHitUpdate_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(BlockHitUpdate)

__flatbuffers_define_struct_scalar_field(BlockHitUpdate, block_index, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(BlockHitUpdate, hitpoints, flatbuffers_float, float)
__flatbuffers_define_struct_scalar_field(BlockHitUpdate, is_destroyed, flatbuffers_bool, flatbuffers_bool_t)

struct ThrusterUpdate {
    alignas(4) uint16_t block_index;
    alignas(4) float applied_thrust;
};
static_assert(sizeof(ThrusterUpdate_t) == 8, "struct size mismatch");

static inline const ThrusterUpdate_t *ThrusterUpdate__const_ptr_add(const ThrusterUpdate_t *p, size_t i) { return p + i; }
static inline ThrusterUpdate_t *ThrusterUpdate__ptr_add(ThrusterUpdate_t *p, size_t i) { return p + i; }
static inline ThrusterUpdate_struct_t ThrusterUpdate_vec_at(ThrusterUpdate_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t ThrusterUpdate__size(void) { return 8; }
static inline size_t ThrusterUpdate_vec_len(ThrusterUpdate_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(ThrusterUpdate)

__flatbuffers_define_struct_scalar_field(ThrusterUpdate, block_index, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(ThrusterUpdate, applied_thrust, flatbuffers_float, float)

struct ShieldUpdate {
    alignas(4) uint16_t block_index;
    alignas(4) float hitpoints;
    alignas(1) flatbuffers_bool_t is_destroyed;
};
static_assert(sizeof(ShieldUpdate_t) == 12, "struct size mismatch");

static inline const ShieldUpdate_t *ShieldUpdate__const_ptr_add(const ShieldUpdate_t *p, size_t i) { return p + i; }
static inline ShieldUpdate_t *ShieldUpdate__ptr_add(ShieldUpdate_t *p, size_t i) { return p + i; }
static inline ShieldUpdate_struct_t ShieldUpdate_vec_at(ShieldUpdate_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t ShieldUpdate__size(void) { return 12; }
static inline size_t ShieldUpdate_vec_len(ShieldUpdate_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(ShieldUpdate)

__flatbuffers_define_struct_scalar_field(ShieldUpdate, block_index, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(ShieldUpdate, hitpoints, flatbuffers_float, float)
__flatbuffers_define_struct_scalar_field(ShieldUpdate, is_destroyed, flatbuffers_bool, flatbuffers_bool_t)

struct MissileSlotUpdate {
    alignas(4) uint16_t block_index;
    alignas(1) uint8_t slot_index;
    alignas(1) flatbuffers_bool_t is_loaded;
    alignas(4) float local_rotation;
};
static_assert(sizeof(MissileSlotUpdate_t) == 8, "struct size mismatch");

static inline const MissileSlotUpdate_t *MissileSlotUpdate__const_ptr_add(const MissileSlotUpdate_t *p, size_t i) { return p + i; }
static inline MissileSlotUpdate_t *MissileSlotUpdate__ptr_add(MissileSlotUpdate_t *p, size_t i) { return p + i; }
static inline MissileSlotUpdate_struct_t MissileSlotUpdate_vec_at(MissileSlotUpdate_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t MissileSlotUpdate__size(void) { return 8; }
static inline size_t MissileSlotUpdate_vec_len(MissileSlotUpdate_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(MissileSlotUpdate)

__flatbuffers_define_struct_scalar_field(MissileSlotUpdate, block_index, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(MissileSlotUpdate, slot_index, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(MissileSlotUpdate, is_loaded, flatbuffers_bool, flatbuffers_bool_t)
__flatbuffers_define_struct_scalar_field(MissileSlotUpdate, local_rotation, flatbuffers_float, float)

struct TurretUpdate {
    alignas(4) uint16_t block_index;
    alignas(4) float local_rotation;
};
static_assert(sizeof(TurretUpdate_t) == 8, "struct size mismatch");

static inline const TurretUpdate_t *TurretUpdate__const_ptr_add(const TurretUpdate_t *p, size_t i) { return p + i; }
static inline TurretUpdate_t *TurretUpdate__ptr_add(TurretUpdate_t *p, size_t i) { return p + i; }
static inline TurretUpdate_struct_t TurretUpdate_vec_at(TurretUpdate_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t TurretUpdate__size(void) { return 8; }
static inline size_t TurretUpdate_vec_len(TurretUpdate_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(TurretUpdate)

__flatbuffers_define_struct_scalar_field(TurretUpdate, block_index, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(TurretUpdate, local_rotation, flatbuffers_float, float)


struct MissileSlot_table { uint8_t unused__; };

static inline size_t MissileSlot_vec_len(MissileSlot_vec_t vec)
__flatbuffers_vec_len(vec)
